gentoo_llvm_targets.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-30 日 14:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gentoo LLVM_TARGETS not Working?</title>
<meta name="author" content="dongdigua" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='css/main.css' />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./../"> UP </a>
 |
 <a accesskey="H" href="https://dongdigua.github.io"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Gentoo LLVM_TARGETS not Working?</h1>
<p>
Recently, I would like to test switching from <code>gcc</code> to <code>clang</code> on my Gentoo VM.<br />
Because if so, I can install <code>Rust</code> and <code>Zig</code> from source<br />
without worrying about adding the HUGE <code>clang</code> dependency that won't be used by other packages.<br />
Later I will remove <code>gcc</code> :)<br />
</p>

<div class="outline-2">
<h2><span class="section-number-2">1.</span> problem</h2>
<div class="outline-text-2" id="text-1">
<p>
First I want to make <a href="https://llvm.org">LLVM</a> not targeting too many platform, but changing <code>LLVM_TARGETS</code> don't work<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">[ebuild  N     ] sys-devel/llvm-15.0.3:15::gentoo  <span style="font-weight: bold; font-style: italic;">USE</span>=<span style="font-style: italic;">"binutils-plugin libffi</span>
<span style="font-style: italic;">ncurses -debug -doc -exegesis -libedit -test -verify-sig -xar -xml -z3 -zstd"</span>
<span style="font-weight: bold; font-style: italic;">LLVM_TARGETS</span>=<span style="font-style: italic;">"(AArch64) (AMDGPU) (ARM) (AVR) (BPF) (Hexagon) (Lanai) (MSP430)</span>
<span style="font-style: italic;">(Mips) (NVPTX) (PowerPC) (RISCV) (Sparc) (SystemZ) (VE) (WebAssembly) (X86)</span>
<span style="font-style: italic;">(XCore) (-ARC) (-CSKY) (-DirectX) (-LoongArch) (-M68k) (-SPIRV)"</span> 241 KiB    
</pre>
</div>
</div>
</div>

<div class="outline-2">
<h2><span class="section-number-2">2.</span> and I found <a href="https://forums.gentoo.org/viewtopic.php?p=8694331">[solved] LLVM_TARGETS not respected?</a>(Mar 2022) on gentoo forum</h2>
<div class="outline-text-2" id="text-2">
<p>
It seems that global <code>LLVM_TARGETS</code> setting is not respected,<br />
and flags such as <code>llvm_targets_AArch64</code>, <code>llvm_targets_ARM</code>, are no longer there.<br />
They're now forced by default as a precaution.<br />
</p>
</div>
</div>


<div class="outline-2">
<h2><span class="section-number-2">3.</span> <i><b>solution</b></i></h2>
<div class="outline-text-2" id="text-3">
</div>
<div class="outline-3">
<h3><span class="section-number-3">3.1.</span> add something like <code>*/* -llvm_targets_AArch64</code> into <code>/etc/portage/profile/package.use.force</code></h3>
<div class="outline-text-3" id="text-3-1">
<p>
I excluded all targets exept for X86, but still 3 left: AMDGPU, BPF, NVPTX<br />
</p>
</div>
</div>
<div class="outline-3">
<h3><span class="section-number-3">3.2.</span> so I also add <code>sys-devel/llvm -llvm_targets_AMDGPU -llvm_targets_BPF -llvm_targets_NVPTX</code> in <code>/etc/portage/package.use/</code></h3>
</div>
<div class="outline-3">
<h3><span class="section-number-3">3.3.</span> and don't forget to add that three excluder to clang or other compiler that uses llvm</h3>
</div>
</div>


<div class="outline-2">
<h2><span class="section-number-2">4.</span> finally I got this:</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-shell">[ebuild  N     ] sys-devel/llvm-15.0.3:15::gentoo  <span style="font-weight: bold; font-style: italic;">USE</span>=<span style="font-style: italic;">"binutils-plugin libffi</span>
<span style="font-style: italic;">ncurses -debug -doc -exegesis -libedit -test -verify-sig -xar -xml -z3 -zstd"</span>
<span style="font-weight: bold; font-style: italic;">LLVM_TARGETS</span>=<span style="font-style: italic;">"(X86) -AArch64 -AMDGPU (-ARC) -ARM -AVR -BPF (-CSKY) (-DirectX)</span>
<span style="font-style: italic;">-Hexagon -Lanai (-LoongArch) (-M68k) -MSP430 -Mips -NVPTX -PowerPC -RISCV</span>
<span style="font-style: italic;">(-SPIRV) -Sparc -SystemZ -VE -WebAssembly -XCore"</span> 241 KiB
</pre>
</div>

<p>
in the end, <a href="https://wiki.gentoo.org/wiki/Gentoo_Cheat_Sheet">Gentoo cheatsheet</a> and <a href="https://wiki.gentoo.org/wiki/Clang">Gentoo Wiki: Clang</a> could be useful.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-10-29 六 00:00</p>
<p class="author">Author: dongdigua</p>
<p class="date">Created: 2022-10-30 日 14:16</p>
</div>
</body>
</html>
